[
    "\"Okay Freeman, be adequate!\"<br>\"...\"<br>\"What the hell does that mean, anyway?\"<br>\"I dunno, sounds like something the Vorts would say...\"",
    "\"Expected value of zero?\"<br>\"That was my nickname in Statistics!\"<br>\"Really? Did you score zero on every test?\"<br>\"No, but my variance was quite high...\"",
    "\"There's plenty of room at the bottom.\"<br>&nbsp;&nbsp;-Richard Feynman",
    "\"All models are wrong, but some are useful.\"<br>&nbsp;&nbsp;-George Box",
    "\"The principle of parsimony, while technically correct, sort of misses the point.\"<br>&nbsp;&nbsp;-William of Ockham",
    "\"Well, Papa, can you multiply triplets?\"<br>\"No, I can only add and subtract them.\"<br>&nbsp;&nbsp;-William Rowan Hamilton",
    "\"Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law.\"<br>&nbsp;&nbsp;-Douglas Hofstadter",
    "\"Oh God! To hear the insect on the leaf pronouncing on the<br> too much life among his hungry brothers in the dust!\"<br>&nbsp;&nbsp;-Charles Dickens, A Christmas Carol",
    "\"...there is no rational explanation for it...\"<br>&nbsp;&nbsp;-Eugene Wigner",
    "\"Then you should say what you mean!\"<br>\"I do, at least - at least I mean what I say - that's the same thing, you know.\"<br>&nbsp;&nbsp;-Alice's Adventures in Wonderland",
    "\"Spacetime tells matter how to move; matter tells spacetime how to curve.\"<br>&nbsp;&nbsp;-John Wheeler",
    "\"An antilibrary is a collection of books that are owned but have not yet been read\"<br>&nbsp;&nbsp;-<a href='https://en.wikipedia.org/wiki/Antilibrary'>Wikipedia</a>",
    "\"It ain't what you don't know that gets you into trouble. It's what you know for sure that just ain't so.\"<br>&nbsp;&nbsp;-Mark Twain",
    "\"The aim of science is to make difficult things understandable in a simpler way; the aim of poetry is [the reverse]. The two are incompatible.\"<br>&nbsp;&nbsp;-Paul A.M. Dirac",
    "\"God made the integers, all else is the work of man.\"<br>&nbsp;&nbsp;-Leopold Kronecker",
    "\"Also, the program itself is probably just a thousand lines of PyTorch.<br>So, there are more GPUs than lines of code!\"<br>&nbsp;&nbsp;-Jim Keller",
    "\"Form is henceforth divorced from matter.\"<br>&nbsp;&nbsp;-Oliver Wendell Holmes",
    "\"The existing scientific concepts cover always only a very limited part of reality,<br>and the other part that has not yet been understood is infinite.\"<br>&nbsp;&nbsp;-Werner Heisenberg",
    "\"When a measure becomes a target, it ceases to be a good measure.\"<br>&nbsp;&nbsp;-Charles Goodhart",
    "\"Truth is ever to be found in simplicity, and not in the multiplicity and confusion of things.\"<br>&nbsp;&nbsp;-Sir Isaac Newton",
    "\"The language model has no relationship to the truth.<br>It is neither on the side of true nor on the side of false;<br>it is on the side of predicting the most likely next word given the previous words and the training data,<br>and will pick out or make up things to suit that purpose.\"<br>&nbsp;&nbsp;-Colin Fraser, Meta, Medium",
    "\"I, in general, I don't argue with [the software team], I respect them.\"<br>&nbsp;&nbsp;-Wei-han Lien, Tenstorrent",
    "\"Either mathematics is too big for the human mind,<br>or the human mind is more than a machine.\"<br>&nbsp;&nbsp;-Kurt Godel"
]
