[
    "\"Okay Freeman, be adequate!\"<br>\"...\"<br>\"What the hell does that mean, anyway?\"<br>\"I dunno, sounds like something the Vorts would say...\"",
    "\"Expected value of zero?\"<br>\"That was my nickname in Statistics!\"<br>\"Really? Did you score zero on every test?\"<br>\"No, but my variance was quite high...\"",
    "\"There's plenty of room at the bottom.\"<br>&nbsp;&nbsp;-Richard Feynman",
    "\"All models are wrong, but some are useful.\"<br>&nbsp;&nbsp;-George Box",
    "\"The principle of parsimony, while technically correct, sort of misses the point.\"<br>&nbsp;&nbsp;-William of Ockham",
    "\"Well, Papa, can you multiply triplets?\"<br>\"No, I can only add and subtract them.\"<br>&nbsp;&nbsp;-William Rowan Hamilton",
    "\"Hofstadter's Law: It always takes longer than you expect, even when you take into account Hofstadter's Law.\"<br>&nbsp;&nbsp;-Douglas Hofstadter",
    "\"Oh God! To hear the insect on the leaf pronouncing on the<br> too much life among his hungry brothers in the dust!\"<br>&nbsp;&nbsp;-Charles Dickens, A Christmas Carol",
    "\"...there is no rational explanation for it...\"<br>&nbsp;&nbsp;-Eugene Wigner",
    "\"Then you should say what you mean!\"<br>\"I do, at least - at least I mean what I say - that's the same thing, you know.\"<br>&nbsp;&nbsp;-Alice's Adventures in Wonderland",
    "\"Spacetime tells matter how to move; matter tells spacetime how to curve.\"<br>&nbsp;&nbsp;-John Wheeler",
    "\"An antilibrary is a collection of books that are owned but have not yet been read\"<br>&nbsp;&nbsp;-<a href='https://en.wikipedia.org/wiki/Antilibrary'>Wikipedia</a>",
    "\"The aim of science is to make difficult things understandable in a simpler way; the aim of poetry is [the reverse]. The two are incompatible.\"<br>&nbsp;&nbsp;-Paul A.M. Dirac",
    "\"God made the integers, all else is the work of man.\"<br>&nbsp;&nbsp;-Leopold Kronecker",
    "\"Also, the program itself is probably just a thousand lines of PyTorch.<br>So, there are more GPUs than lines of code!\"<br>&nbsp;&nbsp;-Jim Keller",
    "\"Form is henceforth divorced from matter.\"<br>&nbsp;&nbsp;-Oliver Wendell Holmes",
    "\"The existing scientific concepts cover always only a very limited part of reality,<br>and the other part that has not yet been understood is infinite.\"<br>&nbsp;&nbsp;-Werner Heisenberg",
    "\"When a measure becomes a target, it ceases to be a good measure.\"<br>&nbsp;&nbsp;-Charles Goodhart",
    "\"Truth is ever to be found in simplicity, and not in the multiplicity and confusion of things.\"<br>&nbsp;&nbsp;-Sir Isaac Newton",
    "\"The language model has no relationship to the truth.<br>It is neither on the side of true nor on the side of false;<br>it is on the side of predicting the most likely next word given the previous words and the training data,<br>and will pick out or make up things to suit that purpose.\"<br>&nbsp;&nbsp;-Colin Fraser, Meta, Medium",
    "\"I, in general, I don't argue with [the software team], I respect them.\"<br>&nbsp;&nbsp;-Wei-han Lien, Tenstorrent",
    "\"Either mathematics is too big for the human mind,<br>or the human mind is more than a machine.\"<br>&nbsp;&nbsp;-Kurt Godel",
    "\"Logic, which alone can give certainty, is the instrument of demonstration; intuition is the instrument of invention.\"<br>&nbsp;&nbsp;-Henri Poincare",
    "\"I told him that I am interested in biology but not from planet Earth.\"<br>&nbsp;&nbsp;-Avi Loeb",
    "\"Python: geared towards children... and PhDs.\"<br>&nbsp;&nbsp;-Carl Kron",
    "\"Programming is solving a problem that has already been solved.\"<br>&nbsp;&nbsp;-Unknown",
    "\"Why do French people just have one egg for breakfast?<br>Because one egg is an oeuf.\"<br>&nbsp;&nbsp;-Ian Harding, OHBM2023",
    "\"Any application that can be written in JavaScript will eventually be written in JavaScript.\"<br>&nbsp;&nbsp;-Jeff Atwood",
    "\"Far it is Practice alone, that makes a Man perfect in any thing.\"<br>&nbsp;&nbsp;-Brook Taylor",
    "\"I am fond of pigs. Dogs look up to us. Cats look down on us. Pigs treat us as equals.\"<br>&nbsp;&nbsp;-Winston Churchill",
    "\"To make no mistakes is not in the power of man;<br>but from their errors and mistakes<br>the wise and good learn wisdom for the future.\"<br>&nbsp;&nbsp;-Plutarch",
    "\"Physicists are made up of atoms. A physicist is an attempt by an atom to understand itself.\"<br>&nbsp;&nbsp;-Michio Kaku",
    "\"Most of the differential equations that exist cannot be solved.<br>And most of the differential equations that can be solved cannot be solved by you.\"<br>&nbsp;&nbsp;-Ethan Siegel's Professor",
    "\"If Euclid failed to kindle your youthful enthusiasm, then you were not born to be a scientific thinker.\"<br>&nbsp;&nbsp;-Albert Einstein",
    "\"Pi is God’s telephone number.\"<br>&nbsp;&nbsp;–Alexander Graham Bell",
    "\"When I die. My first query to the devil will be, what is the meaning of the fine structure constant?\"<br>&nbsp;&nbsp;-Wolfgang Pauli",
    "\"A physicist is just an atom’s way of looking at itself.\"<br>&nbsp;&nbsp;-Niels Bohr",
    "\"I don't use drugs; my dreams are frightening enough.\"<br>&nbsp;&nbsp;-Maurits Cornelis Escher",
    "\"English is to natural languages what JavaScript is to programming languages.\"<br>&nbsp;&nbsp;-Primeagen subscriber (paraphrased)",
    "\"In mathematics, you don't understand things. You just get used to them.\"<br>&nbsp;&nbsp;-John von Neumann",
	"\"According to all known laws of aviation, the bumblebee cannot fly.<br>Its body weight is not in the right proportion to its wingspan.<br>Ignoring these laws, it flies anyway.\"<br>&nbsp;&nbsp;-Andre Saint-Lague",
	"\"Hence the euphemism 'the gentleman who pays the rent' came into being<br>when referring to the family's prized possesion - their pig.\"<br>&nbsp;&nbsp;-Irish American Mom",
	"\"Prediction is very difficult, especially about the future.\"<br>&nbsp;&nbsp;-Niels Bohr (disputed)",
	"\"There are two kinds of languages: the ones people complain about, and the ones nobody uses.\"<br>&nbsp;&nbsp;-Bjarne Stroustrup",
	"\"The more frequently a word is used, the shorter that word tends to be,<br> and vice versa; the less frequently a word is used, the longer it tends to be.\"<br>&nbsp;&nbsp;-Zipf's Law of Abbreviation",
	"\"Debugging is twice as hard as writing the code in the first place.<br>Therefore, if you write the code as cleverly as possible, you are,<br> by definition, not smart enough to debug it.\"<br>&nbsp;&nbsp;-Brian Kernighan",
	"\"Anyone who considers arithmetical methods of producing<br> random digits is, of course, in a state of sin.\"<br>&nbsp;&nbsp;-John von Neumann",
	"\"Mathematics is an experimental science, and<br> definitions do not come first, but later on.\"<br>&nbsp;&nbsp;-Oliver Heaviside",
	"\"You are not expected to understand this.\"<br>&nbsp;&nbsp;-Dennis Ritchie (Unix source code)",
	"\"Ships were made for sinking,<br>Whiskey made for drinking\"&nbsp;&nbsp;-Squirrel Nut Zippers"
]
