{"title": "Coordinates in a Brave Game World", "date": 1656597388288, "author": "Anton", 
"body": "<p class='center'><img src='/images/Blog/StarMatchScreenshot3.png' height='350px'><img src='/images/Blog/StarMatchScreenshot.png' height='350px'></p><p class='caption center'>Star Match: The Penultimate Generation</p><p>While working on the Star Match game with David and Adam, I ran into the problem of expressing coordinates for not only square tilings, as in a regular Euclidean grid, but also triangular and hexagonal tilings as well.</p><p><u>What's the problem?</u></p><p>In a square tiling each tile has four neighbors along 2 degrees of freedom (by degrees of freedom I mean directions to go to reach a tile that shares a border with the current tile). In a hexagonal tiling, each tile has <u>6 neighbors</u> along <u>3 directions of motion</u>, but confined to a Euclidean plane. Star Match is based on the mobile game Royal Match, where you clear tiles to beat levels. Clearing tiles results in tiles from above falling to take the cleared tiles' place.</p><p>A neighbor-based coordinate system is a natural way to implement clearing: a \"row\" of 3 is cleared if 3 consectutive members contain the same image, with rows being defined as tiles that share one of the three (you can think of them as x,y,z) coordinates. Quickly checking for matches requires organizing tiles in \"chains\" (thank you David for the useful terminology!) based on these coordinates.</p><p class='center'><img src='/images/Blog/HexCoordinates.png' height='300px'></p><p class='caption center'>The original schematics for the James Webb space telescope.<br>Note: coordinates may be different from in-game screenshots. The idea is the same.</p><p>For me, at least, working out the mathematical interdependency between the 3 coordinates was <em>painful</em>.</p><p>There is an interdependency because only 2 independent coordinates are required to specify a position on the plane; the 3rd coordinate is redundant. Yet a 2x2x2 neighborhood around the (0,0,0) tile contains 7 tiles in the hexagonal lattice, not 8, so we are not merely finding the power set. An exact formula is given in the figure above.</p><p>This is not the end of the story, though. We also have the triangle coordinates, and triangles are even wierder than hexagons.</p><p class='center'><img src='/images/Blog/StarMatchScreenshot2.png' height='350px'></p><p>For one thing, <u>the unit cell of a triangle tessellation is not a single triangle</u> but a set of 2 adjacent triangles. This means that the centers of triangles do not fall on a regular lattice, while the centers of sets of 2 triangles do. In practice, this meant that to construct the lattice I first constructed a tessellation of 4-sided rhombi and then broke those rhombi up into pairs of triangles. There is a great analogy to crystal structure in chemistry here!</p><p class='center'><img src='/images/Blog/TriangleCoordinates.png' height='300px'></p><p>This also gives us a plan for multi-polygon tessellations. Every tessellation (<a href='https://en.wikipedia.org/wiki/Penrose_tiling'>Penrose tilings</a> excluded) has some kind of unit cell, having either 4-sided or 6-sided symmetry (similar to the <a href='https://en.wikipedia.org/wiki/Crystal_system'>7 crystal systems</a> in 3 dimensions). We just tile these unit cells and break them up into their constituent polygons.</p><p>The real problem is in moving tiles around on this more complicated board.</p>"}